- Arranging random data to sequence vise data

In [1]:
import pandas as pd

## Group by

In [3]:
# creating some dataframe
var1 = pd.DataFrame({'name':['a','b','c','d','b','d','a','c','a','b'],
                    'Sub_1':[12,13,14,15,17,15,13,12,19,17],
                    'Sub_2':[17,21,25,17,24,15,21,23,13,14]
                    })
print('random data')
var1

random data

  name  Sub_1  Sub_2
0    a     12     17
1    b     13     21
2    c     14     25
3    d     15     17
4    b     17     24
5    d     15     15
6    a     13     21
7    c     12     23
8    a     19     13
9    b     17     14

In [4]:
print('arranging data')
var2 = var1.groupby('name')
var2

arranging data

In [7]:
# showing the given data
for x,y in var2:
    print(x)
    print(y)
    print()

a
  name  Sub_1  Sub_2
0    a     12     17
6    a     13     21
8    a     19     13

b
  name  Sub_1  Sub_2
1    b     13     21
4    b     17     24
9    b     17     14

c
  name  Sub_1  Sub_2
2    c     14     25
7    c     12     23

d
  name  Sub_1  Sub_2
3    d     15     17
5    d     15     15

In [8]:
# accessing only a's data
var2.get_group('a')

  name  Sub_1  Sub_2
0    a     12     17
6    a     13     21
8    a     19     13

In [9]:
# accessing only b's data
var2.get_group('b')

  name  Sub_1  Sub_2
1    b     13     21
4    b     17     24
9    b     17     14

In [10]:
# accessing only c's data
var2.get_group('c')

  name  Sub_1  Sub_2
2    c     14     25
7    c     12     23

In [11]:
# accessing only d's data
var2.get_group('d')

  name  Sub_1  Sub_2
3    d     15     17
5    d     15     15

- finding min, max, mean

In [12]:
# minimum
var2.min()

      Sub_1  Sub_2
name
a        12     13
b        13     14
c        12     23
d        15     15

In [13]:
# maximum
var2.max()

      Sub_1  Sub_2
name
a        19     21
b        17     24
c        14     25
d        15     17

In [14]:
# mean
var2.mean()

          Sub_1      Sub_2
name
a     14.666667  17.000000
b     15.666667  19.666667
c     13.000000  24.000000
d     15.000000  16.000000

In [15]:
# median
var2.median()

      Sub_1  Sub_2
name
a      13.0   17.0
b      17.0   21.0
c      13.0   24.0
d      15.0   16.0

- converting to list

In [16]:
li = list(var2)
li

[('a',
    name  Sub_1  Sub_2
  0    a     12     17
  6    a     13     21
  8    a     19     13),
 ('b',
    name  Sub_1  Sub_2
  1    b     13     21
  4    b     17     24
  9    b     17     14),
 ('c',
    name  Sub_1  Sub_2
  2    c     14     25
  7    c     12     23),
 ('d',
    name  Sub_1  Sub_2
  3    d     15     17
  5    d     15     15)]